note/2018/emacs-subroutine/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-02-04 Tue 00:11 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs Subroutine</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Yuan Fu" />
<link rel="stylesheet" type="text/css" href="../../style.css"/>
<link rel="icon" type="image/png" href="../../../favicon.png">
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../../index.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Emacs Subroutine</h1>
<p>
Some goodies I found when glancing through <code>subr.el</code>:
</p>

<pre class="example">
(defalias 'beep 'ding) ;preserve lingual purity
</pre>

<pre class="example">
add-to-ordered-list
add-to-history
define-symbol-prop
locate-library
process-lines
read-char-choice
read-xxx
atomic-change-group
xxx-change-group
momentary-string-display
play-sound
subrp
track-mouse
with-temp-file
with-output-to-string
while-no-input
with-demoted-errors
combine-after-change-calls
with-file-modes
subst-char-in-string
load-history-regexp
forward-whitespace
text-clone-create
define-mail-user-agent
backtrace-frames
make-progress-reporter
with-mutex

(subr-x.el)

string-trim-left
string-trim-xxx
string-remove-prefix

(seq.el)

seq-doseq
seq-let
seq-do-indexed
seq-copy
seq-subseq
seq-drop
seq-take-while
seq-group-by
</pre>

<p>
康斯帕瓦：
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #e45649;">defun</span> <span style="color: #a626a4;">caar</span> (x)
  <span style="color: #9ca0a4; font-style: italic;">"Return the car of the car of X."</span>
  (<span style="color: #e45649;">declare</span> (compiler-macro internal--compiler-macro-cXXr))
  (car (car x)))

(<span style="color: #e45649;">defun</span> <span style="color: #a626a4;">cadr</span> (x)
  <span style="color: #9ca0a4; font-style: italic;">"Return the car of the cdr of X."</span>
  (<span style="color: #e45649;">declare</span> (compiler-macro internal--compiler-macro-cXXr))
  (car (cdr x)))

(<span style="color: #e45649;">defun</span> <span style="color: #a626a4;">cdar</span> (x)
  <span style="color: #9ca0a4; font-style: italic;">"Return the cdr of the car of X."</span>
  (<span style="color: #e45649;">declare</span> (compiler-macro internal--compiler-macro-cXXr))
  (cdr (car x)))

(<span style="color: #e45649;">defun</span> <span style="color: #a626a4;">cddr</span> (x)
  <span style="color: #9ca0a4; font-style: italic;">"Return the cdr of the cdr of X."</span>
  (<span style="color: #e45649;">declare</span> (compiler-macro internal--compiler-macro-cXXr))
  (cdr (cdr x)))

(<span style="color: #e45649;">defun</span> <span style="color: #a626a4;">caaar</span> (x)
  <span style="color: #9ca0a4; font-style: italic;">"Return the `</span><span style="color: #b751b6; font-style: italic;">car</span><span style="color: #9ca0a4; font-style: italic;">' of the `</span><span style="color: #b751b6; font-style: italic;">car</span><span style="color: #9ca0a4; font-style: italic;">' of the `</span><span style="color: #b751b6; font-style: italic;">car</span><span style="color: #9ca0a4; font-style: italic;">' of X."</span>
  (<span style="color: #e45649;">declare</span> (compiler-macro internal--compiler-macro-cXXr))
  (car (car (car x))))

(<span style="color: #e45649;">defun</span> <span style="color: #a626a4;">caadr</span> (x)
  <span style="color: #9ca0a4; font-style: italic;">"Return the `</span><span style="color: #b751b6; font-style: italic;">car</span><span style="color: #9ca0a4; font-style: italic;">' of the `</span><span style="color: #b751b6; font-style: italic;">car</span><span style="color: #9ca0a4; font-style: italic;">' of the `</span><span style="color: #b751b6; font-style: italic;">cdr</span><span style="color: #9ca0a4; font-style: italic;">' of X."</span>
  (<span style="color: #e45649;">declare</span> (compiler-macro internal--compiler-macro-cXXr))
  (car (car (cdr x))))

(<span style="color: #e45649;">defun</span> <span style="color: #a626a4;">cadar</span> (x)
  <span style="color: #9ca0a4; font-style: italic;">"Return the `</span><span style="color: #b751b6; font-style: italic;">car</span><span style="color: #9ca0a4; font-style: italic;">' of the `</span><span style="color: #b751b6; font-style: italic;">cdr</span><span style="color: #9ca0a4; font-style: italic;">' of the `</span><span style="color: #b751b6; font-style: italic;">car</span><span style="color: #9ca0a4; font-style: italic;">' of X."</span>
  (<span style="color: #e45649;">declare</span> (compiler-macro internal--compiler-macro-cXXr))
  (car (cdr (car x))))

(<span style="color: #e45649;">defun</span> <span style="color: #a626a4;">caddr</span> (x)
  <span style="color: #9ca0a4; font-style: italic;">"Return the `</span><span style="color: #b751b6; font-style: italic;">car</span><span style="color: #9ca0a4; font-style: italic;">' of the `</span><span style="color: #b751b6; font-style: italic;">cdr</span><span style="color: #9ca0a4; font-style: italic;">' of the `</span><span style="color: #b751b6; font-style: italic;">cdr</span><span style="color: #9ca0a4; font-style: italic;">' of X."</span>
  (<span style="color: #e45649;">declare</span> (compiler-macro internal--compiler-macro-cXXr))
  (car (cdr (cdr x))))

(<span style="color: #e45649;">defun</span> <span style="color: #a626a4;">cdaar</span> (x)
  <span style="color: #9ca0a4; font-style: italic;">"Return the `</span><span style="color: #b751b6; font-style: italic;">cdr</span><span style="color: #9ca0a4; font-style: italic;">' of the `</span><span style="color: #b751b6; font-style: italic;">car</span><span style="color: #9ca0a4; font-style: italic;">' of the `</span><span style="color: #b751b6; font-style: italic;">car</span><span style="color: #9ca0a4; font-style: italic;">' of X."</span>
  (<span style="color: #e45649;">declare</span> (compiler-macro internal--compiler-macro-cXXr))
  (cdr (car (car x))))

(<span style="color: #e45649;">defun</span> <span style="color: #a626a4;">cdadr</span> (x)
  <span style="color: #9ca0a4; font-style: italic;">"Return the `</span><span style="color: #b751b6; font-style: italic;">cdr</span><span style="color: #9ca0a4; font-style: italic;">' of the `</span><span style="color: #b751b6; font-style: italic;">car</span><span style="color: #9ca0a4; font-style: italic;">' of the `</span><span style="color: #b751b6; font-style: italic;">cdr</span><span style="color: #9ca0a4; font-style: italic;">' of X."</span>
  (<span style="color: #e45649;">declare</span> (compiler-macro internal--compiler-macro-cXXr))
  (cdr (car (cdr x))))

(<span style="color: #e45649;">defun</span> <span style="color: #a626a4;">cddar</span> (x)
  <span style="color: #9ca0a4; font-style: italic;">"Return the `</span><span style="color: #b751b6; font-style: italic;">cdr</span><span style="color: #9ca0a4; font-style: italic;">' of the `</span><span style="color: #b751b6; font-style: italic;">cdr</span><span style="color: #9ca0a4; font-style: italic;">' of the `</span><span style="color: #b751b6; font-style: italic;">car</span><span style="color: #9ca0a4; font-style: italic;">' of X."</span>
  (<span style="color: #e45649;">declare</span> (compiler-macro internal--compiler-macro-cXXr))
  (cdr (cdr (car x))))

(<span style="color: #e45649;">defun</span> <span style="color: #a626a4;">cdddr</span> (x)
  <span style="color: #9ca0a4; font-style: italic;">"Return the `</span><span style="color: #b751b6; font-style: italic;">cdr</span><span style="color: #9ca0a4; font-style: italic;">' of the `</span><span style="color: #b751b6; font-style: italic;">cdr</span><span style="color: #9ca0a4; font-style: italic;">' of the `</span><span style="color: #b751b6; font-style: italic;">cdr</span><span style="color: #9ca0a4; font-style: italic;">' of X."</span>
  (<span style="color: #e45649;">declare</span> (compiler-macro internal--compiler-macro-cXXr))
  (cdr (cdr (cdr x))))

(<span style="color: #e45649;">defun</span> <span style="color: #a626a4;">caaaar</span> (x)
  <span style="color: #9ca0a4; font-style: italic;">"Return the `</span><span style="color: #b751b6; font-style: italic;">car</span><span style="color: #9ca0a4; font-style: italic;">' of the `</span><span style="color: #b751b6; font-style: italic;">car</span><span style="color: #9ca0a4; font-style: italic;">' of the `</span><span style="color: #b751b6; font-style: italic;">car</span><span style="color: #9ca0a4; font-style: italic;">' of the `</span><span style="color: #b751b6; font-style: italic;">car</span><span style="color: #9ca0a4; font-style: italic;">' of X."</span>
  (<span style="color: #e45649;">declare</span> (compiler-macro internal--compiler-macro-cXXr))
  (car (car (car (car x)))))

(<span style="color: #e45649;">defun</span> <span style="color: #a626a4;">caaadr</span> (x)
  <span style="color: #9ca0a4; font-style: italic;">"Return the `</span><span style="color: #b751b6; font-style: italic;">car</span><span style="color: #9ca0a4; font-style: italic;">' of the `</span><span style="color: #b751b6; font-style: italic;">car</span><span style="color: #9ca0a4; font-style: italic;">' of the `</span><span style="color: #b751b6; font-style: italic;">car</span><span style="color: #9ca0a4; font-style: italic;">' of the `</span><span style="color: #b751b6; font-style: italic;">cdr</span><span style="color: #9ca0a4; font-style: italic;">' of X."</span>
  (<span style="color: #e45649;">declare</span> (compiler-macro internal--compiler-macro-cXXr))
  (car (car (car (cdr x)))))

(<span style="color: #e45649;">defun</span> <span style="color: #a626a4;">caadar</span> (x)
  <span style="color: #9ca0a4; font-style: italic;">"Return the `</span><span style="color: #b751b6; font-style: italic;">car</span><span style="color: #9ca0a4; font-style: italic;">' of the `</span><span style="color: #b751b6; font-style: italic;">car</span><span style="color: #9ca0a4; font-style: italic;">' of the `</span><span style="color: #b751b6; font-style: italic;">cdr</span><span style="color: #9ca0a4; font-style: italic;">' of the `</span><span style="color: #b751b6; font-style: italic;">car</span><span style="color: #9ca0a4; font-style: italic;">' of X."</span>
  (<span style="color: #e45649;">declare</span> (compiler-macro internal--compiler-macro-cXXr))
  (car (car (cdr (car x)))))

(<span style="color: #e45649;">defun</span> <span style="color: #a626a4;">caaddr</span> (x)
  <span style="color: #9ca0a4; font-style: italic;">"Return the `</span><span style="color: #b751b6; font-style: italic;">car</span><span style="color: #9ca0a4; font-style: italic;">' of the `</span><span style="color: #b751b6; font-style: italic;">car</span><span style="color: #9ca0a4; font-style: italic;">' of the `</span><span style="color: #b751b6; font-style: italic;">cdr</span><span style="color: #9ca0a4; font-style: italic;">' of the `</span><span style="color: #b751b6; font-style: italic;">cdr</span><span style="color: #9ca0a4; font-style: italic;">' of X."</span>
  (<span style="color: #e45649;">declare</span> (compiler-macro internal--compiler-macro-cXXr))
  (car (car (cdr (cdr x)))))

(<span style="color: #e45649;">defun</span> <span style="color: #a626a4;">cadaar</span> (x)
  <span style="color: #9ca0a4; font-style: italic;">"Return the `</span><span style="color: #b751b6; font-style: italic;">car</span><span style="color: #9ca0a4; font-style: italic;">' of the `</span><span style="color: #b751b6; font-style: italic;">cdr</span><span style="color: #9ca0a4; font-style: italic;">' of the `</span><span style="color: #b751b6; font-style: italic;">car</span><span style="color: #9ca0a4; font-style: italic;">' of the `</span><span style="color: #b751b6; font-style: italic;">car</span><span style="color: #9ca0a4; font-style: italic;">' of X."</span>
  (<span style="color: #e45649;">declare</span> (compiler-macro internal--compiler-macro-cXXr))
  (car (cdr (car (car x)))))

(<span style="color: #e45649;">defun</span> <span style="color: #a626a4;">cadadr</span> (x)
  <span style="color: #9ca0a4; font-style: italic;">"Return the `</span><span style="color: #b751b6; font-style: italic;">car</span><span style="color: #9ca0a4; font-style: italic;">' of the `</span><span style="color: #b751b6; font-style: italic;">cdr</span><span style="color: #9ca0a4; font-style: italic;">' of the `</span><span style="color: #b751b6; font-style: italic;">car</span><span style="color: #9ca0a4; font-style: italic;">' of the `</span><span style="color: #b751b6; font-style: italic;">cdr</span><span style="color: #9ca0a4; font-style: italic;">' of X."</span>
  (<span style="color: #e45649;">declare</span> (compiler-macro internal--compiler-macro-cXXr))
  (car (cdr (car (cdr x)))))

(<span style="color: #e45649;">defun</span> <span style="color: #a626a4;">caddar</span> (x)
  <span style="color: #9ca0a4; font-style: italic;">"Return the `</span><span style="color: #b751b6; font-style: italic;">car</span><span style="color: #9ca0a4; font-style: italic;">' of the `</span><span style="color: #b751b6; font-style: italic;">cdr</span><span style="color: #9ca0a4; font-style: italic;">' of the `</span><span style="color: #b751b6; font-style: italic;">cdr</span><span style="color: #9ca0a4; font-style: italic;">' of the `</span><span style="color: #b751b6; font-style: italic;">car</span><span style="color: #9ca0a4; font-style: italic;">' of X."</span>
  (<span style="color: #e45649;">declare</span> (compiler-macro internal--compiler-macro-cXXr))
  (car (cdr (cdr (car x)))))

(<span style="color: #e45649;">defun</span> <span style="color: #a626a4;">cadddr</span> (x)
  <span style="color: #9ca0a4; font-style: italic;">"Return the `</span><span style="color: #b751b6; font-style: italic;">car</span><span style="color: #9ca0a4; font-style: italic;">' of the `</span><span style="color: #b751b6; font-style: italic;">cdr</span><span style="color: #9ca0a4; font-style: italic;">' of the `</span><span style="color: #b751b6; font-style: italic;">cdr</span><span style="color: #9ca0a4; font-style: italic;">' of the `</span><span style="color: #b751b6; font-style: italic;">cdr</span><span style="color: #9ca0a4; font-style: italic;">' of X."</span>
  (<span style="color: #e45649;">declare</span> (compiler-macro internal--compiler-macro-cXXr))
  (car (cdr (cdr (cdr x)))))

(<span style="color: #e45649;">defun</span> <span style="color: #a626a4;">cdaaar</span> (x)
  <span style="color: #9ca0a4; font-style: italic;">"Return the `</span><span style="color: #b751b6; font-style: italic;">cdr</span><span style="color: #9ca0a4; font-style: italic;">' of the `</span><span style="color: #b751b6; font-style: italic;">car</span><span style="color: #9ca0a4; font-style: italic;">' of the `</span><span style="color: #b751b6; font-style: italic;">car</span><span style="color: #9ca0a4; font-style: italic;">' of the `</span><span style="color: #b751b6; font-style: italic;">car</span><span style="color: #9ca0a4; font-style: italic;">' of X."</span>
  (<span style="color: #e45649;">declare</span> (compiler-macro internal--compiler-macro-cXXr))
  (cdr (car (car (car x)))))

(<span style="color: #e45649;">defun</span> <span style="color: #a626a4;">cdaadr</span> (x)
  <span style="color: #9ca0a4; font-style: italic;">"Return the `</span><span style="color: #b751b6; font-style: italic;">cdr</span><span style="color: #9ca0a4; font-style: italic;">' of the `</span><span style="color: #b751b6; font-style: italic;">car</span><span style="color: #9ca0a4; font-style: italic;">' of the `</span><span style="color: #b751b6; font-style: italic;">car</span><span style="color: #9ca0a4; font-style: italic;">' of the `</span><span style="color: #b751b6; font-style: italic;">cdr</span><span style="color: #9ca0a4; font-style: italic;">' of X."</span>
  (<span style="color: #e45649;">declare</span> (compiler-macro internal--compiler-macro-cXXr))
  (cdr (car (car (cdr x)))))

(<span style="color: #e45649;">defun</span> <span style="color: #a626a4;">cdadar</span> (x)
  <span style="color: #9ca0a4; font-style: italic;">"Return the `</span><span style="color: #b751b6; font-style: italic;">cdr</span><span style="color: #9ca0a4; font-style: italic;">' of the `</span><span style="color: #b751b6; font-style: italic;">car</span><span style="color: #9ca0a4; font-style: italic;">' of the `</span><span style="color: #b751b6; font-style: italic;">cdr</span><span style="color: #9ca0a4; font-style: italic;">' of the `</span><span style="color: #b751b6; font-style: italic;">car</span><span style="color: #9ca0a4; font-style: italic;">' of X."</span>
  (<span style="color: #e45649;">declare</span> (compiler-macro internal--compiler-macro-cXXr))
  (cdr (car (cdr (car x)))))

(<span style="color: #e45649;">defun</span> <span style="color: #a626a4;">cdaddr</span> (x)
  <span style="color: #9ca0a4; font-style: italic;">"Return the `</span><span style="color: #b751b6; font-style: italic;">cdr</span><span style="color: #9ca0a4; font-style: italic;">' of the `</span><span style="color: #b751b6; font-style: italic;">car</span><span style="color: #9ca0a4; font-style: italic;">' of the `</span><span style="color: #b751b6; font-style: italic;">cdr</span><span style="color: #9ca0a4; font-style: italic;">' of the `</span><span style="color: #b751b6; font-style: italic;">cdr</span><span style="color: #9ca0a4; font-style: italic;">' of X."</span>
  (<span style="color: #e45649;">declare</span> (compiler-macro internal--compiler-macro-cXXr))
  (cdr (car (cdr (cdr x)))))

(<span style="color: #e45649;">defun</span> <span style="color: #a626a4;">cddaar</span> (x)
  <span style="color: #9ca0a4; font-style: italic;">"Return the `</span><span style="color: #b751b6; font-style: italic;">cdr</span><span style="color: #9ca0a4; font-style: italic;">' of the `</span><span style="color: #b751b6; font-style: italic;">cdr</span><span style="color: #9ca0a4; font-style: italic;">' of the `</span><span style="color: #b751b6; font-style: italic;">car</span><span style="color: #9ca0a4; font-style: italic;">' of the `</span><span style="color: #b751b6; font-style: italic;">car</span><span style="color: #9ca0a4; font-style: italic;">' of X."</span>
  (<span style="color: #e45649;">declare</span> (compiler-macro internal--compiler-macro-cXXr))
  (cdr (cdr (car (car x)))))

(<span style="color: #e45649;">defun</span> <span style="color: #a626a4;">cddadr</span> (x)
  <span style="color: #9ca0a4; font-style: italic;">"Return the `</span><span style="color: #b751b6; font-style: italic;">cdr</span><span style="color: #9ca0a4; font-style: italic;">' of the `</span><span style="color: #b751b6; font-style: italic;">cdr</span><span style="color: #9ca0a4; font-style: italic;">' of the `</span><span style="color: #b751b6; font-style: italic;">car</span><span style="color: #9ca0a4; font-style: italic;">' of the `</span><span style="color: #b751b6; font-style: italic;">cdr</span><span style="color: #9ca0a4; font-style: italic;">' of X."</span>
  (<span style="color: #e45649;">declare</span> (compiler-macro internal--compiler-macro-cXXr))
  (cdr (cdr (car (cdr x)))))

(<span style="color: #e45649;">defun</span> <span style="color: #a626a4;">cdddar</span> (x)
  <span style="color: #9ca0a4; font-style: italic;">"Return the `</span><span style="color: #b751b6; font-style: italic;">cdr</span><span style="color: #9ca0a4; font-style: italic;">' of the `</span><span style="color: #b751b6; font-style: italic;">cdr</span><span style="color: #9ca0a4; font-style: italic;">' of the `</span><span style="color: #b751b6; font-style: italic;">cdr</span><span style="color: #9ca0a4; font-style: italic;">' of the `</span><span style="color: #b751b6; font-style: italic;">car</span><span style="color: #9ca0a4; font-style: italic;">' of X."</span>
  (<span style="color: #e45649;">declare</span> (compiler-macro internal--compiler-macro-cXXr))
  (cdr (cdr (cdr (car x)))))

(<span style="color: #e45649;">defun</span> <span style="color: #a626a4;">cddddr</span> (x)
  <span style="color: #9ca0a4; font-style: italic;">"Return the `</span><span style="color: #b751b6; font-style: italic;">cdr</span><span style="color: #9ca0a4; font-style: italic;">' of the `</span><span style="color: #b751b6; font-style: italic;">cdr</span><span style="color: #9ca0a4; font-style: italic;">' of the `</span><span style="color: #b751b6; font-style: italic;">cdr</span><span style="color: #9ca0a4; font-style: italic;">' of the `</span><span style="color: #b751b6; font-style: italic;">cdr</span><span style="color: #9ca0a4; font-style: italic;">' of X."</span>
  (<span style="color: #e45649;">declare</span> (compiler-macro internal--compiler-macro-cXXr))
  (cdr (cdr (cdr (cdr x)))))
</pre>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2018-12-22 Sat 19:26</p>
<p class="author">Author: Yuan Fu</p>
<p class="date">Created: 2020-02-04 Tue 00:11</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
